rushup/Cloud-JAM-L4-AzureIoTHub/Projects/STM32L476RG-Nucleo/Applications/Azure_Sns_DM/Src/platform_STM32Cube.c
  if(TargetBoardFeatures.HWAdvanceFeatures) {
    InitHWFeatures();
  }
  
  /* Check the BootLoader Compliance */
  if(CheckBootLoaderCompliance()) {
    AZURE_PRINTF("BootLoader Compliant with FOTA procedure\r\n");
  } else {
    AZURE_PRINTF("Err: BootLoader NOT Compliant with FOTA procedure\r\n");
    AzureExit(AZURE_ERR_BL_COMPLIANCE);
  }

  /* Set Full Scale to +/-2g */
  (TargetBoardFeatures.SnsAltFunc ? BSP_ACCELERO_Set_FS_Value_IKS01A2 : BSP_ACCELERO_Set_FS_Value)(TargetBoardFeatures.HandleAccSensor,2.0f);

  /* initialize timers */
  InitTimers();
  AZURE_PRINTF("Init Application's Timers\r\n");

  /* Initialize random number generartion */
#ifdef USE_MBED_TLS
  TargetBoardFeatures.RngHandle.Instance = RNG;
  HAL_RNG_Init(&TargetBoardFeatures.RngHandle);
  AZURE_PRINTF("Init Random Number Generator\r\n");
#endif /* USE_MBED_TLS*/
    
  /* Enabling HW Features... FreeFall */
  EnableHWFreeFall();

  /* Initializes Timers for WIFI */
  Timer_Config();
  AZURE_PRINTF("Init WIFI's Timers\r\n");

  /* Initializes UART1 for WIFI */
  UART_Configuration(115200);
  AZURE_PRINTF("Init WIFI's UART1\r\n");

  /* Set the WIFI Credential */
  {
    char console_input[40];
    MDM_knownGMD_t known_MetaData[]={
      {GMD_WIFI,sizeof(WIFI_CredAcc_t)},
      {GMD_END    ,0}/* THIS MUST BE THE LAST ONE */
    };

    AZURE_PRINTF("--------------------------\r\n");
    AZURE_PRINTF("|    WIFI Credential     |\r\n");
    AZURE_PRINTF("--------------------------\r\n");
    
    /* Check the MetaDataManager */
    InitMetaDataManager((void *)&known_MetaData,MDM_DATA_TYPE_GMD,NULL);

    /* Recall the WIFI Credential saved */
    MDM_ReCallGMD(GMD_WIFI,(void *)&WIFI_CredAcc);

    if(WIFI_CredAcc.ssid[0]==0) {
      sprintf(WIFI_CredAcc.ssid,"%s",AZURE_DEFAULT_SSID);
      sprintf(WIFI_CredAcc.seckey,"%s",AZURE_DEFAULT_SECKEY);
      WIFI_CredAcc.mode = AZURE_DEFAULT_PRIV_MODE;
      AZURE_PRINTF("\tDefault SSID   : %s\r\n",WIFI_CredAcc.ssid);
      AZURE_PRINTF("\tDefault PassWd : %s\r\n",WIFI_CredAcc.seckey);
      AZURE_PRINTF("\tDefault EncMode: %s\r\n",(WIFI_CredAcc.mode == None) ? "Open" : ((WIFI_CredAcc.mode == WEP) ? "WEP" : "WPA2/WPA2-Personal"));
    } else {
      AZURE_PRINTF("\tSaved SSID   : %s\r\n",WIFI_CredAcc.ssid);
      AZURE_PRINTF("\tSaved PassWd : %s\r\n",WIFI_CredAcc.seckey);
      AZURE_PRINTF("\tSaved EncMode: %s\r\n",(WIFI_CredAcc.mode == None) ? "Open" : ((WIFI_CredAcc.mode == WEP) ? "WEP" : "WPA2/WPA2-Personal"));
    }

    AZURE_PRINTF("\r\nWait 3 seconds for allowing User Button Control:");
    AZURE_PRINTF("\r\n\t - Press one time  for adding the WIFI credential from UART or NFC ");
    AZURE_PRINTF("\r\n\t - Press two times for adding the WIFI credential only from NFC\r\n");
    {
      int32_t CountOn,CountOff;
      for(CountOn=0;CountOn<3;CountOn++) {
        BSP_LED_On(LED2);
        for(CountOff=0;CountOff<10;CountOff++) {
          if(CountOff==2) {
            BSP_LED_Off(LED2);
          }
          /* Handle user button */
          if(ButtonPressed) {
            CounterButtonPress++;
            ButtonPressed=0;
          }
          HAL_Delay(100);
        }
      }
    }

    if(CounterButtonPress==1) {
      /* Enabling UART interaction */
      AZURE_PRINTF("\r\nDo you want to change them?(y/n)\r\n");
      scanf("%s",console_input);
      if(console_input[0]=='y') {
        int32_t ReadFromTerminal=1;

        /* Test if the NFC is present */
        if(TT4_Init() == SUCCESS) {
          AZURE_PRINTF("\tX-NUCLEO-NFC01A1 is present\r\n");
          AZURE_PRINTF("\tDo you want to read them from NFC?(y/n)\r\n");
          scanf("%s",console_input);
          if(console_input[0]=='y') {
            sWifiTokenInfo TokenInfo;
            if(TT4_ReadWifiToken(&TokenInfo) == SUCCESS) {
              ReadFromTerminal=0;

              sprintf(WIFI_CredAcc.ssid,"%s",TokenInfo.NetworkSSID);
              sprintf(WIFI_CredAcc.seckey,"%s",TokenInfo.NetworkKey);

              if (strcmp(TokenInfo.AuthenticationType,"NONE")==0) {
                WIFI_CredAcc.mode = None;
              } else if(strcmp(TokenInfo.AuthenticationType,"WEP")==0) {
                WIFI_CredAcc.mode = WEP;
              } else {
                WIFI_CredAcc.mode = WPA_Personal;
              }
            } else {
              AZURE_PRINTF("Err reading the WIFI's credentials from NFC\r\n");
              AZURE_PRINTF("Add them manually\r\n");
            }
          }
        }

        if(ReadFromTerminal==1) {
          AZURE_PRINTF("\r\nEnter the SSID:\r\n");
          scanf("%s",console_input);
          sprintf(WIFI_CredAcc.ssid,"%s",console_input);
          AZURE_PRINTF("\r\nEnter the PassWd:\r\n");
          scanf("%s",console_input);
          sprintf(WIFI_CredAcc.seckey,"%s",console_input);
          AZURE_PRINTF("\r\nEnter the encryption mode(0:Open, 1:WEP, 2:WPA2/WPA2-Personal):\r\n");
          scanf("%s",console_input);
          switch(console_input[0]){
            case '0':
              WIFI_CredAcc.mode = None;
            break;
            case '1':
              WIFI_CredAcc.mode = WEP;
            break;
            case '2':
              WIFI_CredAcc.mode = WPA_Personal;
            break;
            default:
              AZURE_PRINTF("\r\nWrong Entry. Priv Mode is not compatible\r\n");
              AzureExit(AZURE_ERR_WIFI_CRED);
          }
        }
        AZURE_PRINTF("\tNew SSID   : %s\r\n",WIFI_CredAcc.ssid);
        AZURE_PRINTF("\tNew PassWd : %s\r\n",WIFI_CredAcc.seckey);
        AZURE_PRINTF("\tNew EncMode: %s\r\n",(WIFI_CredAcc.mode == None) ? "Open" : ((WIFI_CredAcc.mode == WEP) ? "WEP" : "WPA2/WPA2-Personal"));

        /* Save the WIFI Credential on MetaDataManager */
        MDM_SaveGMD(GMD_WIFI,(void *)&WIFI_CredAcc);

        /* Save the MetaDataManager in Flash */
        EraseMetaDataManager();
        SaveMetaDataManager();

        AZURE_PRINTF("-----------------------------\r\n");
      }
      AZURE_PRINTF("\r\n");
    } else if(CounterButtonPress==2) {
      int32_t Error=0;
      /* Force Read from NFC */
      if(TT4_Init() == SUCCESS) {
        AZURE_PRINTF("\tX-NUCLEO-NFC01A1 is present\r\n");
        sWifiTokenInfo TokenInfo;
        if(TT4_ReadWifiToken(&TokenInfo) == SUCCESS) {
          sprintf(WIFI_CredAcc.ssid,"%s",TokenInfo.NetworkSSID);
          sprintf(WIFI_CredAcc.seckey,"%s",TokenInfo.NetworkKey);

          if (strcmp(TokenInfo.AuthenticationType,"NONE")==0) {
            WIFI_CredAcc.mode = None;
          } else if(strcmp(TokenInfo.AuthenticationType,"WEP")==0) {
            WIFI_CredAcc.mode = WEP;
          } else {
            WIFI_CredAcc.mode = WPA_Personal;
          }
          AZURE_PRINTF("\tNew SSID   : %s\r\n",WIFI_CredAcc.ssid);
          AZURE_PRINTF("\tNew PassWd : %s\r\n",WIFI_CredAcc.seckey);
          AZURE_PRINTF("\tNew EncMode: %s\r\n",(WIFI_CredAcc.mode == None) ? "Open" : ((WIFI_CredAcc.mode == WEP) ? "WEP" : "WPA2/WPA2-Personal"));

