rushup/Cloud-JAM-L4-AzureIoTHub/Projects/STM32L476RG-Nucleo/Applications/Azure_Sns_DM/Src/platform_STM32Cube.c
          /* Save the WIFI Credential on MetaDataManager */
          MDM_SaveGMD(GMD_WIFI,(void *)&WIFI_CredAcc);

          /* Save the MetaDataManager in Flash */
          EraseMetaDataManager();
          SaveMetaDataManager();

          AZURE_PRINTF("-----------------------------\r\n");
        } else {
          Error=1;
        }
      } else {
        Error=1;
      }
      if(Error) {
        AZURE_PRINTF("Err reading the WIFI's credentials from NFC\r\n");
        AzureExit(AZURE_ERR_NFC);
      }
    }
  }

  /* Initialize the WIFI module */
  wifi_state = wifi_state_idle;
  memset(&config,0,sizeof(wifi_config));
  config.power=wifi_active;
  config.power_level=high;
  config.dhcp=on;//use DHCP IP address
  status = wifi_init(&config);
  if(status!=WiFi_MODULE_SUCCESS) {
    AZURE_PRINTF("Err in Config\r\n");
    AzureExit(AZURE_ERR_WIFI);
  } else {
    AZURE_PRINTF("WIFI module Configured\r\n");
  }

  GET_Configuration_Value("nv_wifi_macaddr",(uint32_t *)macaddstart);
  macaddstart[17]='\0';
  AZURE_PRINTF("WiFi MAC Address is: %s\r\n",macaddstart);

  status = wifi_connect(WIFI_CredAcc.ssid, WIFI_CredAcc.seckey, WIFI_CredAcc.mode);
  if(status!=WiFi_MODULE_SUCCESS) {
    AZURE_PRINTF("Err Connecting to WIFI\r\n");
    AzureExit(AZURE_ERR_WIFI_CON);
  }

  /* Wait WIFI Connection */
  while(wifi_state != wifi_state_connected) {
    HAL_Delay(100);
  }  
  
  /* initialize Real Time Clock */
  InitRTC();

  /* Check if Data stored in BackUp register0: No Need to reconfigure RTC */
  if(HAL_RTCEx_BKUPRead(&TargetBoardFeatures.RtcHandle, RTC_BKP_DR0) != 0x32F2){
    int32_t NTP_OK=0;
    while(!NTP_OK) {
      /* Configure RTC Calendar */
      char ipAddress[] =  "time-d.nist.gov";
      //char ipAddress[] =  "time-c.nist.gov";
      uint8_t tcpPort  =  37;
      uint8_t socketHandle;
      status = wifi_socket_client_open((uint8_t*)ipAddress, tcpPort, "t", &socketHandle);
      if(status!=WiFi_MODULE_SUCCESS) {
        AZURE_PRINTF("Err opening socket with NTP server\r\n");
      } else {
        AZURE_PRINTF("WiFi opened socket with NTP server [%s]\r\n",ipAddress);
        ConnectedToNTP=1;
        NTPServerClosed=1;

        // Wait to receive data
        while(ConnectedToNTP) {
          HAL_Delay(100);
        }

        // Wait socket close
        AZURE_PRINTF("Wait NTP server to close \r\n");
        while(NTPServerClosed) {
          HAL_Delay(100);
        }
        //status = wifi_socket_client_close(socketHandle);
        //if(status!=WiFi_MODULE_SUCCESS) {
        //  AZURE_PRINTF("Err closing socket with NTP server\r\n");
        //} else {
        AZURE_PRINTF("Socket closed with NTP server\r\n");
        NTP_OK = 1;
        //}
      }

      if(!NTP_OK) {
        AZURE_PRINTF("I'll try again to connect to NTP server in 2 seconds\r\n");
        HAL_Delay(2000);
      }
    }
  } else {
    uint8_t aShowTime[50] = {0};
    uint8_t aShowDate[50] = {0};
    RTC_CalendarShow(aShowTime,aShowDate);
    AZURE_PRINTF("Init Real Time Clock %s %s\r\n",aShowDate,aShowTime);
  }

  /* Init the Local Buffer for mbedTLS for Telemetry */
  LocalBufferInit(&localBufferReading[AZURE_SOCKET_TELEMETRY]);
  /* Init the Local Buffer for mbedTLS for Device Management */
  LocalBufferInit(&localBufferReading[AZURE_SOCKET_FOTA]);
  return 0;
}

/**
  * @brief  Function for signaling Error
  * @param  AZURE1_ERROR Value Error Type
  * @retval None
  */
void AzureExit(AZURE1_ERROR Value)
{
  AZURE_PRINTF("\r\nErr Type %s\r\n",ENUM_TO_STRING(AZURE1_ERROR,Value));
  AZURE_PRINTF("\tNecessity to restart the Board\r\n");
  /* Infinite led blinking */
  BSP_LED_Off(LED2);
  while(1) {
    int32_t Counter;
    /* Blinking Error Code... */
    for(Counter=0;Counter<Value;Counter++) {
      BSP_LED_On(LED2);
      HAL_Delay(200);
      BSP_LED_Off(LED2);
      HAL_Delay(400);
    }
    HAL_Delay(4000);
  }
}

/**
  * @brief  Function for starting the timer for sending the Telemetry data to IoT
  * @param  None
  * @retval None
  */
void StartTimer1(void) {
  /* Starting timer */
  if(HAL_TIM_OC_Start_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
    /* Starting Error */
    STM32_Error_Handler();
  }

  /* Set the new Capture compare value */
  {
    uint32_t uhCapture = __HAL_TIM_GET_COUNTER(&TimCCHandle);
    /* Set the Capture Compare Register value */
    __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_1, (uhCapture + TargetBoardFeatures.TIM_CC1_Pulse));
  }

  AZURE_PRINTF("Channel 1 for Timer 1 started\r\n");
}

/**
  * @brief  Function for pausing the timer for sending the Telemetry data to IoT
  * @param  None
  * @retval None
  */
void StopTimer1(void) {
  /* Stop timer */
  if(HAL_TIM_OC_Stop_IT(&TimCCHandle, TIM_CHANNEL_1) != HAL_OK){
    /* Starting Error */
    STM32_Error_Handler();
  }
  AZURE_PRINTF("Channel 1 for Timer 1 stopped\r\n");
}

/**
  * @brief  Function called when the Socket is closed
  * @param  uint8_t* socketID pointer to the socket handle
  * @retval None
  */
void ind_wifi_socket_client_remote_server_closed(uint8_t * socketID)
{
  if(SocketHandleAzure[AZURE_SOCKET_FOTA]==(*socketID)) {
    if(OTAStatus != OTA_STATUS_END ) {
      AZURE_PRINTF("Err: Socket for WIFI closed before full OTA Trasmission\r\n");
      OTAStatus = OTA_STATUS_ERROR;
    } else {
      SocketHandleAzure[AZURE_SOCKET_FOTA]=0xFF;
    }
  } else {
	// waiting for NTP server to close
	if (NTPServerClosed)
		NTPServerClosed = 0;
    AZURE_PRINTF("WIFI closed =%x\r\n",* socketID);
  }
}

/**
 * @brief  WiFi callback for data received
 * @param  uint8_t pSocketHandle socket handle
 * @param  uint8_t * data_ptr pointer to buffer containing data received 
 * @param  uint32_t message_size number of bytes in message received
 * @param  uint32_t chunk_size numeber of bytes in chunk
 * @retval None
 */
void ind_wifi_socket_data_received(uint8_t pSocketHandle,uint8_t * data_ptr, uint32_t message_size, uint32_t chunk_size)
{
#if 0
  /* Just for Debug */
  AZURE_PRINTF("****** Received buffer for a socket...***** \r\n");
  AZURE_PRINTF("socket received =\r\n");
  AZURE_PRINTF("\tSock=%d\r\n",pSocketHandle);
  //AZURE_PRINTF("\tdata=%s\r\n",data_ptr);
  AZURE_PRINTF("\tmessage_size=%ld\r\n",message_size);
  AZURE_PRINTF("\tchunk_size=%ld\r\n",chunk_size);
#endif

