rushup/Cloud-JAM-L4-AzureIoTHub/Projects/STM32L476RG-Nucleo/Applications/Azure_Sns_DM/Src/platform_STM32Cube.c
  if(ConnectedToNTP==1) {
    if(message_size==4){
      time_t epochTimeToSetForSystem = SynchronizationAgentConvertNTPTime2EpochTime(data_ptr,message_size);
      if (TimingSystemSetSystemTime(epochTimeToSetForSystem)== 0){
        AZURE_PRINTF("Err Failed to set system time. \r\n");
      } else {
        AZURE_PRINTF("Set UTC Time: %s\r\n",(get_ctime(&epochTimeToSetForSystem)));
        ConnectedToNTP =0;
      }
    }
#ifdef AZURE_ENABLE_REGISTRATION
  } else if (RegistrationRequest==AGENT_START) {
    memcpy(BufferServiceAnswer,data_ptr,chunk_size);
    RegistrationRequest = AGENT_DATA;
#endif /* AZURE_ENABLE_REGISTRATION */
  } else if(SocketHandleAzure[AZURE_SOCKET_FOTA]==pSocketHandle) {
    /* Secure mbedTLS socket for FOTA */
    if(LocalBufferPushBuffer(&localBufferReading[AZURE_SOCKET_FOTA], (void*) data_ptr,chunk_size)==0) {
      AZURE_PRINTF("Err: for Pushing Buffer for FOTA\r\n");
    }
  } else if(SocketHandleAzure[AZURE_SOCKET_TELEMETRY]==pSocketHandle) {
    /* Secure mbedTLS socket for Telemetry */
    if(LocalBufferPushBuffer(&localBufferReading[AZURE_SOCKET_TELEMETRY], (void*) data_ptr,chunk_size)==0) {
      AZURE_PRINTF("Err: for Pushing Buffer for Telemetry\r\n");
    }
  }
}

/**
 * @brief  WiFi callback when it is connected to Access Point
 * @param  None
 * @retval None
 */
void ind_wifi_connected()
{
  AZURE_PRINTF("WiFi connected to AccessPoint\r\n");
  wifi_state = wifi_state_connected;
}

/**
 * @brief  WiFi callback when it is initilized
 * @param  None
 * @retval None
 */
void ind_wifi_on()
{
  AZURE_PRINTF("\r\n\nwifi started and ready...\r\n");
  wifi_state = wifi_state_ready;
}

/** @brief function for providing the default TLS I/O interface
 * @param None
 * @retval IO_INTERFACE_DESCRIPTION* Pointer to the default TLS I/O interface
 */
const IO_INTERFACE_DESCRIPTION* platform_get_default_tlsio(void)
{
#ifdef USE_MBED_TLS
  return tlsio_mbedtls_get_interface_description();
#else /* USE_MBED_TLS */
  return tlsio_STM32Cube_get_interface_description();
#endif /* USE_MBED_TLS */
}

/** @brief Function for de-initializing the platform
 * @param None
 * @retval None
 */
void platform_deinit(void)
{
  /* TODO: Insert here any platform specific one time de-initialization code like.
  This has to undo what has been done in platform_init. */
}


/** @brief Initialize all the MEMS1 sensors
 * @param None
 * @retval None
 */
static void Init_MEM1_Sensors(void)
{
  /* Accelero */
#ifndef IKS01A2
  /* Test if the board is IK01A1 */
  if (BSP_ACCELERO_Init_IKS01A1( ACCELERO_SENSORS_AUTO, &TargetBoardFeatures.HandleAccSensor ) == COMPONENT_OK) {
    AZURE_PRINTF("IKS01A1 board\n\r");
    AZURE_PRINTF("Ok Accelero Sensor\n\r");
    TargetBoardFeatures.SnsAltFunc = 0;
  } else {
#else /* IKS01A2 */
  {
#endif /* IKS01A2 */
    TargetBoardFeatures.SnsAltFunc = 1;
    if (BSP_ACCELERO_Init_IKS01A2( ACCELERO_SENSORS_AUTO, &TargetBoardFeatures.HandleAccSensor ) == COMPONENT_OK){
      AZURE_PRINTF("IKS01A2 board\n\r");
      AZURE_PRINTF("Ok Accelero Sensor\n\r");
    } else {
      AZURE_PRINTF("IKS01A2 or IKS01A1 board not present, Emulation enabled\n\r");
      TargetBoardFeatures.EmulateSns=1;
    }
  }

  if(!TargetBoardFeatures.EmulateSns) {
    /* DS3/DSM or DS0 */
    /* This section works with IKS01A1 or with IKS01A1/A2 Autodiscovery */
#ifndef IKS01A2
    if(!TargetBoardFeatures.SnsAltFunc){
      uint8_t WhoAmI;
      BSP_ACCELERO_Get_WhoAmI(TargetBoardFeatures.HandleAccSensor,&WhoAmI);
      if(LSM6DS3_ACC_GYRO_WHO_AM_I==WhoAmI) {
        AZURE_PRINTF("\tDS3 DIL24 Present\n\r");
        TargetBoardFeatures.HWAdvanceFeatures = 1;
      } else {
        TargetBoardFeatures.HWAdvanceFeatures = 0;
      }
    } else {
#else /* IKS01A2 */
   {
#endif /* IKS01A2 */
      TargetBoardFeatures.HWAdvanceFeatures = 1;
    }

    /* Gyro */
    if((TargetBoardFeatures.SnsAltFunc ? BSP_GYRO_Init_IKS01A2 : BSP_GYRO_Init)( GYRO_SENSORS_AUTO, &TargetBoardFeatures.HandleGyroSensor )==COMPONENT_OK){
      AZURE_PRINTF("Ok Gyroscope Sensor\n\r");
    } else {
      AZURE_PRINTF("Err Gyroscope Sensor\n\r");
      while(1);
    }

    if((TargetBoardFeatures.SnsAltFunc ? BSP_MAGNETO_Init_IKS01A2 : BSP_MAGNETO_Init)( MAGNETO_SENSORS_AUTO, &TargetBoardFeatures.HandleMagSensor )==COMPONENT_OK){
      AZURE_PRINTF("Ok Magneto Sensor\n\r");
    } else {
      AZURE_PRINTF("Err Magneto Sensor\n\r");
      while(1);
    }

    /* Humidity */
    if((TargetBoardFeatures.SnsAltFunc ? BSP_HUMIDITY_Init_IKS01A2 : BSP_HUMIDITY_Init)( HUMIDITY_SENSORS_AUTO, &TargetBoardFeatures.HandleHumSensor )==COMPONENT_OK){
      AZURE_PRINTF("Ok Humidity Sensor\n\r");
    } else {
      AZURE_PRINTF("Err Humidity Sensor\n\r");
    }

    /* Temperature1 */
    if((TargetBoardFeatures.SnsAltFunc ? BSP_TEMPERATURE_Init_IKS01A2 : BSP_TEMPERATURE_Init)( TEMPERATURE_SENSORS_AUTO, &TargetBoardFeatures.HandleTempSensors[TargetBoardFeatures.NumTempSensors] )==COMPONENT_OK){
       AZURE_PRINTF("Ok Temperature Sensor1\n\r");
       TargetBoardFeatures.NumTempSensors++;
    } else {
      AZURE_PRINTF("Err Temperature Sensor1\n\r");
    }

    /* Temperature2 */
#ifndef IKS01A2
    if((TargetBoardFeatures.SnsAltFunc ? BSP_TEMPERATURE_Init_IKS01A2 : BSP_TEMPERATURE_Init) (TargetBoardFeatures.SnsAltFunc ? LPS22HB_T_0: LPS25HB_T_0,&TargetBoardFeatures.HandleTempSensors[TargetBoardFeatures.NumTempSensors] )==COMPONENT_OK){
#else /* IKS01A2 */
    if(BSP_TEMPERATURE_Init_IKS01A2(LPS22HB_T_0,&TargetBoardFeatures.HandleTempSensors[TargetBoardFeatures.NumTempSensors] )==COMPONENT_OK){      
#endif /* IKS01A2 */
      AZURE_PRINTF("Ok Temperature Sensor2\n\r");
      TargetBoardFeatures.NumTempSensors++;
    } else {
      AZURE_PRINTF("Err Temperature Sensor2\n\r");
    }

    /* Pressure */
    if((TargetBoardFeatures.SnsAltFunc ? BSP_PRESSURE_Init_IKS01A2 : BSP_PRESSURE_Init)( PRESSURE_SENSORS_AUTO, &TargetBoardFeatures.HandlePressSensor )==COMPONENT_OK){
      AZURE_PRINTF("Ok Pressure Sensor\n\r");
    } else {
      AZURE_PRINTF("Err Pressure Sensor\n\r");
    }

    /*  Enable all the sensors */
    if(TargetBoardFeatures.HandleAccSensor) {
      if((TargetBoardFeatures.SnsAltFunc ? BSP_ACCELERO_Sensor_Enable_IKS01A2 : BSP_ACCELERO_Sensor_Enable)( TargetBoardFeatures.HandleAccSensor )==COMPONENT_OK) {
        AZURE_PRINTF("Enabled Accelero Sensor\n\r");
      }
    }

    if(TargetBoardFeatures.HandleGyroSensor) {
      if((TargetBoardFeatures.SnsAltFunc ? BSP_GYRO_Sensor_Enable_IKS01A2 : BSP_GYRO_Sensor_Enable)( TargetBoardFeatures.HandleGyroSensor )==COMPONENT_OK) {
        AZURE_PRINTF("Enabled Gyroscope Sensor\n\r");
      }
    }

