rushup/Cloud-JAM-L4-AzureIoTHub/Projects/STM32L476RG-Nucleo/Applications/Azure_Sns_DM/Src/platform_STM32Cube.c
}
#endif /* USE_STM32L4XX_NUCLEO */

/**
  * @brief  Output Compare callback in non blocking mode
  * @param  htim : TIM OC handle
  * @retval None
  */
void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim)
{
  uint32_t uhCapture=0;

  /* TIM1_CH1 toggling with frequency = 2Hz */
  if(htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1) {
    uhCapture = HAL_TIM_ReadCapturedValue(htim, TIM_CHANNEL_1);
    /* Set the Capture Compare Register value */
    __HAL_TIM_SET_COMPARE(&TimCCHandle, TIM_CHANNEL_1, (uhCapture + TargetBoardFeatures.TIM_CC1_Pulse));
    SendData=1;
  }
}


/**
* @brief  Function for initializing timers for sending the Telemetry data to IoT hub
 * @param  None
 * @retval None
 */
static void InitTimers(void)
{
  uint32_t uwPrescalerValue;

  /* Timer Output Compare Configuration Structure declaration */
  TIM_OC_InitTypeDef sConfig;

  /* Compute the prescaler value to have TIM3 counter clock equal to 2 KHz */
  uwPrescalerValue = (uint32_t) ((SystemCoreClock / 2000) - 1);

  /* Set TIM1 instance (Motion)*/
  TimCCHandle.Instance = TIM1;
  TimCCHandle.Init.Period        = 65535;
  TimCCHandle.Init.Prescaler     = uwPrescalerValue;
  TimCCHandle.Init.ClockDivision = 0;
  TimCCHandle.Init.CounterMode   = TIM_COUNTERMODE_UP;
  if(HAL_TIM_OC_Init(&TimCCHandle) != HAL_OK) {
    /* Initialization Error */
    STM32_Error_Handler();
  }

 /* Configure the Output Compare channels */
 /* Common configuration for all channels */
  sConfig.OCMode     = TIM_OCMODE_TOGGLE;
  sConfig.OCPolarity = TIM_OCPOLARITY_LOW;

  /* Output Compare Toggle Mode configuration: Channel1 */
  TargetBoardFeatures.TIM_CC1_Pulse = sConfig.Pulse = DEFAULT_TIM_CC1_PULSE;
  if(HAL_TIM_OC_ConfigChannel(&TimCCHandle, &sConfig, TIM_CHANNEL_1) != HAL_OK) {
    /* Configuration Error */
    STM32_Error_Handler();
  }
}


/**
* @brief  Function for initializing the Real Time Clock
 * @param  None
 * @retval None
 */
static void InitRTC(void)
{
  RTC_HandleTypeDef *RtcHandle = &TargetBoardFeatures.RtcHandle;

  /* Configure RTC prescaler and RTC data registers */
  /* RTC configured as follow:
      - Hour Format    = Format 24
      - Asynch Prediv  = Value according to source clock
      - Synch Prediv   = Value according to source clock
      - OutPut         = Output Disable
      - OutPutPolarity = High Polarity
      - OutPutType     = Open Drain
  */

  RtcHandle->Instance = RTC;
  RtcHandle->Init.HourFormat = RTC_HOURFORMAT_24;
  RtcHandle->Init.AsynchPrediv = RTC_ASYNCH_PREDIV;
  RtcHandle->Init.SynchPrediv = RTC_SYNCH_PREDIV;
  RtcHandle->Init.OutPut = RTC_OUTPUT_DISABLE;
  RtcHandle->Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  RtcHandle->Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;

  if(HAL_RTC_Init(RtcHandle) != HAL_OK) {
    STM32_Error_Handler();
  }
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void STM32_Error_Handler(void)
{
  /* User may add here some code to deal with this error */
  while(1){
  }
}

/**
 * @brief  EXTI line detection callback.
 * @param  uint16_t GPIO_Pin Specifies the pins connected EXTI line
 * @retval None
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch(GPIO_Pin){
  case KEY_BUTTON_PIN:
    ButtonPressed = 1;
    break;
#ifndef IKS01A2
   case M_INT1_PIN:
#endif /* IKS01A2 */
   case LSM6DSL_INT1_O_PIN:
    MEMSInterrupt=1;
    break;
  }
}


/**
* @brief  Period elapsed callback in non blocking mode
*         This timer is used for calling back User registered functions with information
* @param  htim TIM handle
* @retval None
*/
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  Wifi_TIM_Handler(htim);
}


/**
* @brief  function called after the end of GET/HEAD request for FOTA
* @param  void* context type of request (GET/HEAD)
* @param  IO_SEND_RESULT send_result Results of the request (IO_SEND_OK/...)
* @retval None
*/
static void onSendCompleteFOTA(void* context, IO_SEND_RESULT send_result)
{
  int32_t *TypeOfRequest = (int32_t *)context;
  if (send_result != IO_SEND_OK){
    AZURE_PRINTF("onSendCompleteFOTA Err for HTTP %s\r\n",((*TypeOfRequest) == HTTP_HEAD_REQUEST) ? "HEAD" : "GET"); 
  }
}


/**
* @brief  function called After the Socket open request  for FOTA
* @param  void* context (not Used)
* @param  IO_OPEN_RESULT open_result Results of the open command (IO_OPEN_OK/...)
* @retval None
*/
static void onOpenCompleteFOTA(void* context, IO_OPEN_RESULT open_result)
{  
  if (open_result != IO_OPEN_OK){
    AZURE_PRINTF("onOpenCompleteFOTA Err\r\n"); 
  }
}

/**
* @brief  function called when we are receiving data on the socket open for FOTA
* @param  void* context type of request (GET/HEAD)
* @param  unsigned char* data_ptr pointer to the data received
* @param  size_t size size to the data received
* @retval None
*/
static void onBytesReceivedFOTA(void* context, const unsigned char* data_ptr, size_t size)
{
  int32_t *TypeOfRequest = (int32_t *)context; 
#ifdef USE_STM32L4XX_NUCLEO
  static int32_t PaddingBytes=0;
#endif /* USE_STM32L4XX_NUCLEO */

  if((*TypeOfRequest) == HTTP_HEAD_REQUEST) {
    /* for the HEAD Request */
    uint8_t *StartAddress=NULL;
    OTAStatus = OTA_STATUS_RUNNIG;
#ifdef DEBUG_OTA_RECEIVE
    AZURE_PRINTF("message from HEAD Request Size=%d\r\n",size);
#endif /* DEBUG_OTA_RECEIVE */

    /* Make the parsing of the header */
    if(FullOTASize==0) {
      /* Search the String "Content-Range: bytes" */
      StartAddress = (uint8_t *) strstr( (char *) data_ptr, "Content-Range: bytes");
      if(StartAddress!=NULL) {
          StartAddress = (uint8_t *) strstr((char *) StartAddress, "/");
          if(StartAddress!=NULL) {
            StartAddress++;
            FullOTASize = atoi((char *) StartAddress);
            AZURE_PRINTF("(Content-Range:) Full OTA size=%ld\r\n",FullOTASize);
          } else {
            AZURE_PRINTF("Err... retriving the Full OTA Size...(Content-Range: bytes)\r\n");
            OTAStatus = OTA_STATUS_ERROR;
            return;
          }
      } else {
        /* Search the String "Content-Lenght:" */
        StartAddress = (uint8_t *) strstr( (char *) data_ptr, "Content-Length:");
        if(StartAddress!=NULL) {
          StartAddress+=16; // for moving to the end of "Content-Length: "
          FullOTASize = atoi((char *) StartAddress);
          AZURE_PRINTF("(Content-Length:) Full OTA size=%ld\r\n",FullOTASize);
        } else {
          AZURE_PRINTF("Err... retriving the Full OTA Size...(Content-Length:)\r\n");
          OTAStatus = OTA_STATUS_ERROR;
          return;
        }
      }
      /* Padding the OTA size for L476 Board */
#ifdef USE_STM32L4XX_NUCLEO
      if(FullOTASize&0x7) {
        PaddingBytes = 8 - (FullOTASize&0x7);
        AZURE_PRINTF("\tPaddingBytes=%ld\r\n",PaddingBytes);
        FullOTASize += PaddingBytes;
        AZURE_PRINTF("\tOTA Round=%ld\r\n",FullOTASize);
      }
#endif /* USE_STM32L4XX_NUCLEO */
    } else {
#ifdef DEBUG_OTA_RECEIVE
      AZURE_PRINTF("Consuming remaining bytes from HEAD request\r\n");
#endif /* DEBUG_OTA_RECEIVE */
      /* Search the end of HEAD request... */
      StartAddress = (uint8_t *) strstr( (char *) data_ptr, "\r\n\r\n");      
      if(StartAddress!=NULL) {
        OTAStatus = OTA_STATUS_END;
      }
    }
  } else {
    /* for the GET Request */
    uint8_t *StartAddress=NULL;
    static uint32_t SizeOfUpdate=0;
    uint32_t RealMessageSize=0;
#ifdef USE_STM32L4XX_NUCLEO
    static uint64_t ValueToWrite=0;
    static uint8_t *Pointer= (uint8_t *) &ValueToWrite;
    static int32_t PointerCounter= 0;
    int32_t counter;
#endif /* USE_STM32L4XX_NUCLEO */

