rushup/Cloud-JAM-L4-AzureIoTHub/Projects/STM32L476RG-Nucleo/Applications/Azure_Sns_DM/Src/platform_STM32Cube.c
#define MCR_OTA_DOUBLE_WORLD(size)                  \
{                                                   \
  for(counter=0;counter<(size);counter++) {         \
    Pointer[PointerCounter] = StartAddress[counter];\
    PointerCounter++;                               \
    /* Write the Double Word */                     \
    if(PointerCounter==8) {                         \
      UpdateFWBlueMS(&SizeOfUpdate,Pointer, 8,1);   \
      PointerCounter=0;                             \
      ValueToWrite=0;                               \
    }                                               \
  }                                                 \
}
    
    if(SizeOfUpdate==0) {
      /* Search the Content-Length: */
     StartAddress = (uint8_t *) strstr( (char *) data_ptr, "Content-Length:");
      if(StartAddress!=NULL) {
        StartAddress+=16; // for moving to the end of "Content-Length: "
        SizeOfUpdate = atoi((char *) StartAddress);
#ifdef DEBUG_OTA_RECEIVE
        AZURE_PRINTF("Chunck OTA size=%ld\r\n",SizeOfUpdate);
#endif /* DEBUG_OTA_RECEIVE */
      } else {
#ifdef DEBUG_OTA_RECEIVE
        AZURE_PRINTF("Starting OTA not found.. move to next chunk\r\n");
#endif /* DEBUG_OTA_RECEIVE */
      }
    }

    /* If we had found the Chunk OTA Size */
    if(SizeOfUpdate!=0) {
      if(OTAStatus==OTA_STATUS_START) {
        /* Search the real Start Postion skipping the Banner */
        StartAddress = (uint8_t *) strstr( (char *) data_ptr, "\r\n\r\n");
        if(StartAddress!=NULL) {
          StartAddress += 4;
          RealMessageSize= size - (StartAddress - data_ptr);
#ifdef DEBUG_OTA_RECEIVE
          AZURE_PRINTF("RealMessageSize=%d\r\n",RealMessageSize);
#endif /* DEBUG_OTA_RECEIVE */

          OTAStatus=OTA_STATUS_RUNNIG;

          MCR_OTA_DOUBLE_WORLD(RealMessageSize);
#ifdef USE_STM32L4XX_NUCLEO
          if(PaddingBytes) {
            if(ReadRemSizeOfUpdate()==8) {
              /* Flash the Padding bytes */
              AZURE_PRINTF("Flashing the last chunk of 8 bytes\r\n");
              SizeOfUpdate+=PaddingBytes; /* This for the next if(SizeOfUpdate==0) condition */
              UpdateFWBlueMS(&SizeOfUpdate,Pointer, 8,1);
              PointerCounter=0; /* This could be avoided */
              ValueToWrite=0;   /* This could be avoided */
            }
          }
#endif /* USE_STM32L4XX_NUCLEO */

          /* Control if we are at the end... */
          if(SizeOfUpdate==0) {
            OTAStatus = OTA_STATUS_END;
#ifdef DEBUG_OTA_RECEIVE
            AZURE_PRINTF("A OTA_STATUS_END\r\n");
          } else {
            AZURE_PRINTF("A Remaining Size of Update=%d\r\n",SizeOfUpdate);
#endif /* DEBUG_OTA_RECEIVE */
          }
        } else {
#ifdef DEBUG_OTA_RECEIVE
          AZURE_PRINTF("Starting OTA not found.. move to next chunk\r\n");
#endif /* DEBUG_OTA_RECEIVE */
        }
      } else {
        StartAddress = (unsigned char *)data_ptr;
#ifdef DEBUG_OTA_RECEIVE
        AZURE_PRINTF("New Message=%d\r\n",size);
#endif /* DEBUG_OTA_RECEIVE */

        MCR_OTA_DOUBLE_WORLD(size);

#ifdef USE_STM32L4XX_NUCLEO
        if(PaddingBytes) {
          if(ReadRemSizeOfUpdate()==8) {
            /* Flash the Padding bytes */
            AZURE_PRINTF("Flashing the last chunk of 8 bytes\r\n");
            SizeOfUpdate+=PaddingBytes; /* This for the next if(SizeOfUpdate==0) condition */
            UpdateFWBlueMS(&SizeOfUpdate,Pointer, 8,1);
            PointerCounter=0; /* This could be avoided */
            ValueToWrite=0;   /* This could be avoided */
          }
        }
#endif /* USE_STM32L4XX_NUCLEO */

        /* Control if we are at the end... */
        if(SizeOfUpdate==0) {
          OTAStatus = OTA_STATUS_END;
#ifdef DEBUG_OTA_RECEIVE
          AZURE_PRINTF("B OTA_STATUS_END\r\n");
        } else {
          AZURE_PRINTF("B Remaining Size of Update=%d\r\n",SizeOfUpdate);
#endif /* DEBUG_OTA_RECEIVE */
        }
      }
    }
  }
}

/**
* @brief  function called when there is one error
* @param  void* context (not Used)
* @retval None
*/
static void onIoErrorFOTA(void* context)
{  
  AZURE_PRINTF("Err: onIoErrorFOTA callback\r\n");
}

/** @brief  function called after the Socket close request  for FOTA
* @param  void* context (not Used)
* @retval None
*/
static void onCloseCompleteOTA(void* context)
{  
  AZURE_PRINTF("onCloseCompleteOTA callback\r\n");
}

/**
  * @brief  Execute the Firmware update after the Command FOTA
  * @param  char *hostname Server address
  * @param  char type 's'/'t'->Secure/NotSecure socket
  * @param  uint32_t port_num Server port number
  * @param  char *path FOTA path
  * @retval AZURE1_OTA FOTA Status Error/Success -> OTA_STATUS_ERROR/OTA_STATUS_NULL
  */
AZURE1_OTA FOTACallback(char * hostname,char type, uint32_t  port_num,char * path)
{
  char    buf[256];
  const IO_INTERFACE_DESCRIPTION* io_interface_description;
  XIO_HANDLE XIO_Instance;
  TLSIO_CONFIG tls_io_config;
  int32_t TypeOfRequest;
  int32_t ChunkNum;

  AZURE_PRINTF("Download FOTA from: HostName=[%s] Type=[%s] port=[%ld] File=[%s]\r\n",hostname,(type=='s') ? "Secure": "NotSecure", port_num,path);

  ReportState(Downloading);
  /* This because we want to be sure that this message reach the IOT hub */
  WaitAllTheMessages();

  /* Interface Description */
  io_interface_description = tlsio_mbedtls_get_interface_description();
  if (io_interface_description == NULL) {
    AZURE_PRINTF("Err: io_interface_description\r\n");
    return OTA_STATUS_ERROR;
  }    
  AZURE_PRINTF("Ok io_interface_description\r\n");

  tls_io_config.hostname = hostname;
  tls_io_config.port = port_num;
  /* XIO_CREATE */
  XIO_Instance = xio_create(io_interface_description, &tls_io_config);
  if(XIO_Instance==NULL) {
    AZURE_PRINTF("Err: xio_create\r\n");
    OTAStatus = OTA_STATUS_ERROR;
    goto FOTA_exit;
  }
  AZURE_PRINTF("Ok xio_create\r\n");

  /* XIO_SETOPTION */
  if(xio_setoption(XIO_Instance,  "TrustedCerts", certificates)!=0) {
    AZURE_PRINTF("Err: xio_setoption\r\n");
    OTAStatus = OTA_STATUS_ERROR;
    goto FOTA_exit;
  }
  AZURE_PRINTF("Ok xio_setoption\r\n");

