rushup/Cloud-JAM-L4-AzureIoTHub/Projects/STM32L476RG-Nucleo/Applications/Azure_Sns_DM/Src/platform_STM32Cube.c
  /* XIO_OPEN */
  OTAStatus=OTA_STATUS_NULL;
  if(xio_open(XIO_Instance, onOpenCompleteFOTA, NULL, onBytesReceivedFOTA, &TypeOfRequest, onIoErrorFOTA, NULL)!=0) {
    AZURE_PRINTF("Err: xio_open\r\n");
    OTAStatus = OTA_STATUS_ERROR;
    goto FOTA_exit;
  }
  AZURE_PRINTF("Ok xio_open\r\n");
  
  /* XIO_SEND HEAD Request  */
  OTAStatus=OTA_STATUS_START;
  TypeOfRequest= HTTP_HEAD_REQUEST;
  sprintf(buf,"HEAD %s HTTP/1.1\r\nHost: %s\r\nRange: bytes=0-1\r\n\r\n",path,hostname);
  if(xio_send(XIO_Instance, buf, strlen(buf),  onSendCompleteFOTA, &TypeOfRequest)!=0) {
    AZURE_PRINTF("Err: xio_send\r\n");
    OTAStatus = OTA_STATUS_ERROR;
    goto FOTA_exit;
  } else {
    AZURE_PRINTF("Ok xio_send HEAD Request\r\n");
  }

  /* Wait the end of HEAD */
  while((OTAStatus != OTA_STATUS_END) & (OTAStatus != OTA_STATUS_ERROR)) {
    xio_dowork(XIO_Instance);
    HAL_Delay(100);
  }

  if(OTAStatus == OTA_STATUS_ERROR) {
    goto FOTA_exit;
  }

  /* Clean the Flash before the Real HTTP GET */
  StartUpdateFWBlueMS(FullOTASize, 0);
  for(ChunkNum=0;(ChunkNum*FOTA_CHUNK_SIZE)<FullOTASize;ChunkNum++) {
    /* XIO_SEND GET Request  */
    OTAStatus = OTA_STATUS_START;
    TypeOfRequest= HTTP_GET_REQUEST;


    /* Prepare Request */
    if(((ChunkNum+1)*FOTA_CHUNK_SIZE-1)<FullOTASize) {
      sprintf(buf,"GET %s HTTP/1.1\r\nHost: %s\r\nRange: bytes=%ld-%ld\r\n\r\n",path,hostname,ChunkNum*FOTA_CHUNK_SIZE,(ChunkNum+1)*FOTA_CHUNK_SIZE-1);
    } else {
      sprintf(buf,"GET %s HTTP/1.1\r\nHost: %s\r\nRange: bytes=%ld-%ld\r\n\r\n",path,hostname,ChunkNum*FOTA_CHUNK_SIZE,FullOTASize);
    }

    if(xio_send(XIO_Instance, buf, strlen(buf),  onSendCompleteFOTA, &TypeOfRequest)!=0) {
      AZURE_PRINTF("Err: xio_send\r\n");
      OTAStatus = OTA_STATUS_ERROR;
      goto FOTA_exit;
    } else {
      AZURE_PRINTF("Ok xio_send GET (%03ld/%03ld) Request\r\n",ChunkNum,(FullOTASize+FOTA_CHUNK_SIZE-1)/FOTA_CHUNK_SIZE-1);
    }

    /* Wait the end of Chuck or Error */
    while((OTAStatus != OTA_STATUS_END) & (OTAStatus != OTA_STATUS_ERROR)) {
      xio_dowork(XIO_Instance);
      HAL_Delay(100);
    }

    if(OTAStatus == OTA_STATUS_ERROR) {
      goto FOTA_exit;
    } else {
      OTAStatus = OTA_STATUS_NULL;
    }
  }

  if(xio_close(XIO_Instance, onCloseCompleteOTA, NULL)!=0) {
    AZURE_PRINTF("Err: xio_close\r\n");
    OTAStatus = OTA_STATUS_ERROR;
    goto FOTA_exit;
  } else {
    AZURE_PRINTF("Ok xio_close\r\n");
  }

FOTA_exit:
  if(OTAStatus == OTA_STATUS_NULL) {
    /* Everything was ok */
    AZURE_PRINTF("OTA Downloaded\r\n");
    ReportState(DownloadComplete);
    WaitAllTheMessages();
    return OTAStatus;
  } else {
    /* The socket was closed before the end of FOTA trasmission... */
    AZURE_PRINTF("\r\nErr During FOTA... Sorry retry...\r\n");
    return OTA_STATUS_ERROR;
  }
}


/**
  * @brief This function provides accurate delay (in milliseconds) based
  *        on variable incremented.
  * @note This is a user implementation using WFI state
  * @param Delay specifies the delay time length, in milliseconds.
  * @retval None
  */
void HAL_Delay(__IO uint32_t Delay)
{
  uint32_t tickstart = 0;
  tickstart = HAL_GetTick();
  while((HAL_GetTick() - tickstart) < Delay){
    __WFI();
  }
}

/**
  * @brief This function initializes the GPIO for NFC expansion board
  * @param None
  * @retval None
  */

void M24SR_GPOInit(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __GPIOA_CLK_ENABLE();

  /* Configure GPIO pins for GPO (PA6)*/
#ifndef I2C_GPO_INTERRUPT_ALLOWED
  GPIO_InitStruct.Pin = M24SR_GPO_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(M24SR_GPO_PIN_PORT, &GPIO_InitStruct);
#else
  GPIO_InitStruct.Pin = M24SR_GPO_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(M24SR_GPO_PIN_PORT, &GPIO_InitStruct);
  /* Enable and set EXTI9_5 Interrupt to the lowest priority */
  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
#endif

  /* Configure GPIO pins for DISABLE (PA7)*/
  GPIO_InitStruct.Pin = M24SR_RFDIS_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(M24SR_RFDIS_PIN_PORT, &GPIO_InitStruct);
}

/**
  * @brief  This function wait the time given in param (in milisecond)
	* @param	time_ms: time value in milisecond
  */
void M24SR_WaitMs(uint32_t time_ms)
{
  HAL_Delay(time_ms);
}

/**
  * @brief  This function retrieve current tick
  * @param	ptickstart: pointer on a variable to store current tick value
  */
void M24SR_GetTick( uint32_t *ptickstart )
{
  *ptickstart = HAL_GetTick();
}
/**
  * @brief  This function read the state of the M24SR GPO
	* @param	none
  * @retval GPIO_PinState : state of the M24SR GPO
  */
void M24SR_GPO_ReadPin( GPIO_PinState * pPinState)
{
  *pPinState = HAL_GPIO_ReadPin(M24SR_GPO_PIN_PORT,M24SR_GPO_PIN);
}

/**
  * @brief  This function set the state of the M24SR RF disable pin
	* @param	PinState: put RF disable pin of M24SR in PinState (1 or 0)
  */
void M24SR_RFDIS_WritePin( GPIO_PinState PinState)
{
  HAL_GPIO_WritePin(M24SR_RFDIS_PIN_PORT,M24SR_RFDIS_PIN,PinState);
}


#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: AZURE_PRINTF("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1){
  }
}
#endif

#ifdef USE_STM32L4XX_NUCLEO
/**
  * @brief  Gets the page of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The page of a given address
  */
static uint32_t GetPage(uint32_t Addr)
{
  uint32_t page = 0;

  if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)) {
    /* Bank 1 */
    page = (Addr - FLASH_BASE) / FLASH_PAGE_SIZE;
  } else {
    /* Bank 2 */
    page = (Addr - (FLASH_BASE + FLASH_BANK_SIZE)) / FLASH_PAGE_SIZE;
  }
  return page;
}

/**
  * @brief  Gets the bank of a given address
  * @param  Addr: Address of the FLASH Memory
  * @retval The bank of a given address
  */
static uint32_t GetBank(uint32_t Addr)
{
  uint32_t bank = 0;

  if (READ_BIT(SYSCFG->MEMRMP, SYSCFG_MEMRMP_FB_MODE) == 0){
    /* No Bank swap */
    if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)) {
      bank = FLASH_BANK_1;
    } else {
      bank = FLASH_BANK_2;
    }
  } else {
    /* Bank swap */
    if (Addr < (FLASH_BASE + FLASH_BANK_SIZE)) {
      bank = FLASH_BANK_2;
    } else {
      bank = FLASH_BANK_1;
    }
  }
  return bank;
}

/**
 * @brief User function for Erasing the MDM on Flash
 * @param None
 * @retval uint32_t Success/NotSuccess [1/0]
 */
uint32_t UserFunctionForErasingFlash(void) {
  FLASH_EraseInitTypeDef EraseInitStruct;
  uint32_t SectorError = 0;
  uint32_t Success=1;

  EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
  EraseInitStruct.Banks       = GetBank(MDM_FLASH_ADD);
  EraseInitStruct.Page        = GetPage(MDM_FLASH_ADD);
  EraseInitStruct.NbPages     = 2;

  /* Unlock the Flash to enable the flash control register access *************/
  HAL_FLASH_Unlock();

  if(HAL_FLASHEx_Erase(&EraseInitStruct, &SectorError) != HAL_OK){
    /* Error occurred while sector erase. 
      User can add here some code to deal with this error. 
      SectorError will contain the faulty sector and then to know the code error on this sector,
      user can call function 'HAL_FLASH_GetError()'
      FLASH_ErrorTypeDef errorcode = HAL_FLASH_GetError(); */
    Success=0;
    STM32_Error_Handler();
  }

  /* Lock the Flash to disable the flash control register access (recommended
  to protect the FLASH memory against possible unwanted operation) *********/
  HAL_FLASH_Lock();

  return Success;
}

/**
 * @brief User function for Saving the MDM  on the Flash
 * @param void *InitMetaDataVector Pointer to the MDM beginning
 * @param void *EndMetaDataVector Pointer to the MDM end
 * @retval uint32_t Success/NotSuccess [1/0]
 */
uint32_t UserFunctionForSavingFlash(void *InitMetaDataVector,void *EndMetaDataVector)
{
  uint32_t Success=1;

  /* Store in Flash Memory */
  uint32_t Address = MDM_FLASH_ADD;
  uint64_t *WriteIndex;

  /* Unlock the Flash to enable the flash control register access *************/
  HAL_FLASH_Unlock();
  for(WriteIndex =((uint64_t *) InitMetaDataVector); WriteIndex<((uint64_t *) EndMetaDataVector); WriteIndex++) {
    if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, Address,*WriteIndex) == HAL_OK){
      Address = Address + 8;
    } else {
      /* Error occurred while writing data in Flash memory.
         User can add here some code to deal with this error
         FLASH_ErrorTypeDef errorcode = HAL_FLASH_GetError(); */
      STM32_Error_Handler();
      Success =0;
    }
  }

  /* Lock the Flash to disable the flash control register access (recommended
   to protect the FLASH memory against possible unwanted operation) *********/
  HAL_FLASH_Lock();
 
  return Success;
}
#endif /* USE_STM32L4XX_NUCLEO */
/******************* (C) COPYRIGHT 2017 STMicroelectronics *****END OF FILE****/
